---
kind: property
id: P:Autodesk.Revit.DB.Architecture.ContinuousRailType.Transition
source: html/d9516f8d-2fdc-67a8-f845-d58457260536.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRailType.Transition Property

The transition option of the rail.

## Syntax (C#)
```csharp
public RailTransitionOption Transition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration